function Setting= Controller_HL(dt)
% 階層型線形化コントローラの設定
%% dt = 0.025 くらいの時に有効（これより粗いdtの時はZOH誤差を無視しているためもっと穏やかなゲインの方が良い）
% 機体名：足柄 2025/06/09 小関チューニング %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Setting.F1=lqrd([0 1;0 0],[0;1],diag([100,1]),[0.1],dt);                                % z 
% Setting.F2=lqrd(diag([1,1,1],1),[0;0;0;1],diag([1500,1000,200,1]),[0.1],dt); % xdiag([100,10,10,1])
% Setting.F3=lqrd(diag([1,1,1],1),[0;0;0;1],diag([1500,1000,200,1]),[0.1],dt); % ydiag([100,10,10,1])
% Setting.F4=lqrd([0 1;0 0],[0;1],diag([100,10]),[0.1],dt);                       % ヨー角 
Setting.F1=lqrd([0 1;0 0],[0;1],diag([100,1]),[0.1],dt);                                % z 
Setting.F2=lqrd(diag([1,1,1],1),[0;0;0;1],diag([1500,1000,200,1]),[0.1],dt); % xdiag([100,10,10,1])
Setting.F3=lqrd(diag([1,1,1],1),[0;0;0;1],diag([1500,1000,200,1]),[0.1],dt); % ydiag([100,10,10,1])
Setting.F4=lqrd([0 1;0 0],[0;1],diag([300,10]),[0.1],dt);                       % ヨー角 
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Setting.F1= [28.4299    8.0587];%lqrd([0 1;0 0],[0;1],diag([100,1]),[0.1],dt);                                % z 
% Setting.F2=[ 82.3694  132.1277   64.7875   13.9398];%lqrd(diag([1,1,1],1),[0;0;0;1],diag([100,100,10,1]),[0.01],dt); % xdiag([100,10,10,1])
% Setting.F3=[ 82.3694  132.1277   64.7875   13.9398];%lqrd(diag([1,1,1],1),[0;0;0;1],diag([100,100,10,1]),[0.01],dt); % ydiag([100,10,10,1])
% Setting.F4= [28.4299    8.0587];%lqrd([0 1;0 0],[0;1],diag([100,10]),[0.1],dt);                       % ヨー角 

% % dt = 0.2 くらいの時用
% Setting.F1=lqrd([0 1;0 0],[0;1],diag([100,1]),[0.1],dt);                                % z 
% Setting.F2=lqrd(diag([1,1,1],1),[0;0;0;1],diag([1,1,1,1]),[1],dt); % xdiag([100,10,10,1])
% Setting.F3=lqrd(diag([1,1,1],1),[0;0;0;1],diag([1,1,1,1]),[1],dt); % ydiag([100,10,10,1])
% Setting.F4=lqrd([0 1;0 0],[0;1],diag([100,10]),[0.1],dt);                       % ヨー角 


% 極配置
% Setting.F2=place(diag([1,1,1],1),[0;0;0;1],Eig);
% Setting.F3=place(diag([1,1,1],1),[0;0;0;1],Eig);

% 設定確認
Setting.dt = dt;
% eig(diag([1,1,1],1)-[0;0;0;1]*Setting.F2)
end