function Setting= Controller_HL(dt)
% 階層型線形化コントローラの設定
%% dt = 0.025 くらいの時に有効（これより粗いdtの時はZOH誤差を無視しているためもっと穏やかなゲインの方が良い）
% 機体名：足柄 2025/06/09 小関チューニング %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Setting.F1=lqrd([0 1;0 0],[0;1],diag([100,1]),[1],dt);                                % z 
Setting.F2=lqrd(diag([1,1,1],1),[0;0;0;1],diag([1500,1000,200,1]),[0.01],dt); % xdiag([100,10,10,1])
Setting.F3=lqrd(diag([1,1,1],1),[0;0;0;1],diag([1500,1000,200,1]),[0.01],dt); % ydiag([100,10,10,1])
Setting.F4=lqrd([0 1;0 0],[0;1],diag([100,10]),[0.1],dt);                       % ヨー角 

% 設定確認
Setting.dt = dt;
eig(diag([1,1,1],1)-[0;0;0;1]*Setting.F2)
end
